2022.04.26.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-26 Tue 08:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2022.04.19.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2022.05.03.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of April 19 to 26, 2022.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Multicore OCaml: March 2022</a></li>
<li><a href="#2">OUPS meetup may 2022 (french only)</a></li>
<li><a href="#3">JFLA 2022: Call for Participation (in French)</a></li>
<li><a href="#org1e35f67">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Multicore OCaml: March 2022</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/multicore-ocaml-march-2022/9692/1">https://discuss.ocaml.org/t/multicore-ocaml-march-2022/9692/1</a>
</p>
</div>

<div id="outline-container-org01b2f81" class="outline-3">
<h3 id="org01b2f81">Anil Madhavapeddy announced</h3>
<div class="outline-text-3" id="text-org01b2f81">
<p>
Welcome to the March 2022 <a href="https://github.com/ocaml-multicore/ocaml-multicore">Multicore OCaml</a> monthly report! This
update along with the <a href="https://discuss.ocaml.org/tag/multicore-monthly">previous updates</a> have been compiled by me,
@ctk21, @kayceesrk and @shakthimaan.
</p>

<p>
We have continued steadily towards making a stable OCaml 5.0 release, as you can see from the long list of fixes
later &#x2013; thank you for all your contributions! Platform configurations that were formerly supported in the 4.x
branches for OpenBSD, FreeBSD, and NetBSD have now been re-enabled. ARM64 support (for macOS, Linux and the BSDs) is
stable in trunk, and ARM CFI integration has been merged as a follow-up to facilitate debugging and profiling.
Notably, this also includes <a href="https://github.com/ocaml/ocaml/pull/11004">memory model tests for ARMv8 and Power
ports</a>. The Windows mingw64 port is also working again in trunk.
</p>

<p>
An <a href="https://github.com/ocaml/ocaml/pull/11093">effects tutorial</a> has also been contributed to the OCaml manual;
feedback continues to be welcome even after it's merged in.  As you experiment with effects, please do continue to
post to this forum with questions or comments about your learnings.
</p>

<p>
The Sandmark benchmark project has added bytecode analysis to address any performance regressions. We have also been
working on obtaining measurements for the compilation data points. The current-bench pipeline production deployments
has significant UI changes, and now has alert notifications for the benchmark runs.
</p>

<p>
As always, the Multicore OCaml open and completed tasks are listed first, which are then followed by the ecosystem
tooling projects. The Sandmark, sandmark-nightly, and current-bench project updates are finally presented for your
reference.
</p>

<p>
<i>Editor’s note: please find the full changelog following the archive link above.</i>
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">OUPS meetup may 2022 (french only)</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/oups-meetup-may-2022-french-only/9715/1">https://discuss.ocaml.org/t/oups-meetup-may-2022-french-only/9715/1</a>
</p>
</div>

<div id="outline-container-org81d10bb" class="outline-3">
<h3 id="org81d10bb">zapashcanon announced</h3>
<div class="outline-text-3" id="text-org81d10bb">
<p>
Le prochain OUPS aura lieu le <b>jeudi 12 mai</b> 2022. Le rendez-vous est fixé à <b>19h</b> en <b>salle 15-16 101</b> , <b>4
place Jussieu</b> , 75005 Paris.
</p>

<p>
<b>L'inscription est obligatoire</b> pour pouvoir accéder au meetup ! Votre nom complet doit être disponible.
L'inscription s'effectue sur <a href="https://www.meetup.com/fr-FR/ocaml-paris">meetup</a>.
</p>

<p>
Toutes les informations sont disponibles sur <a href="https://oups.frama.io">le site du oups</a>.
</p>

<p>
J'aimerais aussi signaler que les slides et vidéos des exposés passés <a href="https://oups.frama.io/past.html">sont maintenant
disponibles</a> ! :partying_face:
</p>

<p>
<b>Programme</b>
</p>
</div>

<div id="outline-container-org01677ab" class="outline-4">
<h4 id="org01677ab">Gospel &amp; Ortac - Clément Pascutto</h4>
<div class="outline-text-4" id="text-org01677ab">
<p>
Gospel is a behavioural specification language for OCaml program. It provides developers with a non-invasive and
easy-to-use syntax to annotate their module interfaces with formal contracts that describe type invariants,
mutability, function pre-conditions and post-conditions, effects, exceptions, and <a href="https://ocaml-gospel.github.io/gospel/">much
more</a>!
</p>

<p>
ortac: OCaml Runtime Assertion Checking.
</p>
</div>
</div>

<div id="outline-container-org3bc0f7f" class="outline-4">
<h4 id="org3bc0f7f">MirageOS 4 - Romain Calascibetta</h4>
<div class="outline-text-4" id="text-org3bc0f7f">
<p>
MirageOS 4 vient de sortir récemment et c'est l'occasion de (re)présenter ce projet permettant de construire des
unikernels. Nous y présenterons les nouvelles features et possibilités et nous ferons une introspection de 3 ans de
travail de l'équipe core.
</p>
</div>
</div>

<div id="outline-container-orga72a3f8" class="outline-4">
<h4 id="orga72a3f8">Tezt: OCaml Tezos Test Framework - Romain Bardou</h4>
<div class="outline-text-4" id="text-orga72a3f8">
<p>
Tezt is a test framework for OCaml. It is well suited for unit and regression tests and particularly shines for
integration tests, i.e. tests that launch external processes. It was made with a focus on user experience. It allows
you to easily select tests from the command-line and provides pretty logs. It also can run tests in parallel,
automatically split the set of tests into several well-balanced batches to be run in parellel CI jobs, produce JUnit
outputs, and more. It has been in use at Nomadic for the last 2 years and is thus quite battle-tested.
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">JFLA 2022: Call for Participation (in French)</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2022-04/msg00008.html">https://sympa.inria.fr/sympa/arc/caml-list/2022-04/msg00008.html</a>
</p>
</div>

<div id="outline-container-org8e12d64" class="outline-3">
<h3 id="org8e12d64">Timothy Bourke announced</h3>
<div class="outline-text-3" id="text-org8e12d64">
<p>
[ This message is intentionally written in French. It is a call for
participation for the "Francophone Days on Functional Languages" to be
held, finally and fingers crossed, at the end of June. Some of the
articles are written in English. They are available online:
<a href="https://hal.inria.fr/JFLA2022/">https://hal.inria.fr/JFLA2022/</a> ]
</p>

<p>
<b>Merci de faire circuler : premier appel à participation</b>
</p>

<p>
JFLA'2022 (<a href="http://jfla.inria.fr/jfla2022.html">http://jfla.inria.fr/jfla2022.html</a>)
</p>

<p>
Journées Francophones des Langages Applicatifs
</p>

<p>
Saint-Médard-d'Excideuil - du 28 juin au 1er juillet 2022
</p>

<p>
Les inscriptions aux JFLA 2022 - en présence ! - sont désormais ouvertes :
</p>

<p>
<a href="https://www.azur-colloque.fr/DR04/inscription/preinscription/203/fr">https://www.azur-colloque.fr/DR04/inscription/preinscription/203/fr</a>
</p>

<p>
Ces journées réunissent concepteurs, utilisateurs et théoriciens ;
elles ont pour ambition de couvrir les domaines des langages
applicatifs, de la preuve formelle, de la vérification de programmes,
et des objets mathématiques qui sous-tendent ces outils. Ces domaines
doivent être pris au sens large : nous souhaitons promouvoir les ponts
entre les différentes thématiques.
</p>

<p>
L'inscription est un forfait qui comprend notamment l'hébergement en
pension complète sur le site des journées :
</p>
<ul class="org-ul">
<li>participant·e plein tarif, chambre simple : 660 euros</li>
<li>étudiant·e orateur·ice, en chambre double : 0 euro</li>
</ul>

<p>
Nous espérons que vous serez nombreux à participer à ces journées.
Inscrivez-vous dès que possible ! En particulier, les étudiant·es
orateur·ices sont invité·es à s'inscrire, même s'ils ne paient pas
grâce à nos sponsors.
</p>

<p>
Vous pouvez d'ores et déjà vous inscrire au salon de discussion framateam afin
d'échanger ensemble :
<a href="https://framateam.org/signup_user_complete/?id=gnbebtncubnbpe96ok9kam8t9y">https://framateam.org/signup_user_complete/?id=gnbebtncubnbpe96ok9kam8t9y</a>
</p>

<p>
Tout le programme est à retrouver ici : <a href="http://jfla.inria.fr/jfla2022.html">http://jfla.inria.fr/jfla2022.html</a>
</p>
</div>

<div id="outline-container-org76859f7" class="outline-4">
<h4 id="org76859f7">Dates importantes</h4>
<div class="outline-text-4" id="text-org76859f7">
<ul class="org-ul">
<li>17 juin 2022 : date limite d'inscription aux journées</li>
<li>28 juin au 1er juillet 2022 : journées</li>
</ul>
</div>
</div>

<div id="outline-container-org514386a" class="outline-4">
<h4 id="org514386a">Cours invités</h4>
<div class="outline-text-4" id="text-org514386a">
<ul class="org-ul">
<li>Delphine Demange (IRISA, Université de Rennes 1)
"Si2-FIP: Programmation Fonctionnelle en Licence 1 avec Scala"</li>

<li>Denis Mérigoux (Inria)
"Rust pour le formaliste impatient"</li>
</ul>
</div>
</div>

<div id="outline-container-orga68dec3" class="outline-4">
<h4 id="orga68dec3">Exposé invité</h4>
<div class="outline-text-4" id="text-orga68dec3">
<ul class="org-ul">
<li>Matthias Puech (INA GRM)
Titre à venir - avec une surprise !</li>
</ul>
</div>
</div>

<div id="outline-container-org58f3129" class="outline-4">
<h4 id="org58f3129">Articles acceptés</h4>
<div class="outline-text-4" id="text-org58f3129">
<p>
L'ensemble des articles acceptés est disponible sous forme d'une
collection HAL :
     <a href="https://hal.inria.fr/JFLA2022">https://hal.inria.fr/JFLA2022</a>
</p>
</div>
</div>

<div id="outline-container-org097e339" class="outline-4">
<h4 id="org097e339">Comité de programme</h4>
<div class="outline-text-4" id="text-org097e339">
<ul class="org-ul">
<li>Chantal Keller  LMF, Université Paris-Saclay    (Présidente)</li>
<li>Timothy Bourke  Inria, ÉNS de Paris         (Vice-président)</li>

<li>Sandrine Blazy          Irisa, Université Rennes 1</li>
<li>Frédéric Bour           Tarides - Inria</li>
<li>Guillaume Bury          OcamlPro</li>
<li>Stefania Dumbrava       Samovar, ENSIIE, Télécom Sud Paris</li>
<li>Diane Gallois-Wong      Nomadic Labs</li>
<li>Adrien Guatto           IRIF, Université de Paris</li>
<li>David Janin             LaBRI, Université de Bordeaux</li>
<li>Marie Kerjean           LIPN, Université Paris 13</li>
<li>Luc Pellissier          LACL, Université Paris-Est Créteil</li>
<li>Mário Pereira           NOVA-LINCS, Universidade Nova de Lisboa</li>
<li>Alix Trieu              Aarhus University</li>
<li>Yannick Zakowski        LIP, Inria, ÉNS de Lyon</li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-org1e35f67" class="outline-2">
<h2 id="org1e35f67">Old CWN</h2>
<div class="outline-text-2" id="text-org1e35f67">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="orged8edb8">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
